---
kind: property
id: P:Autodesk.Revit.DB.Category.Id
source: html/1588405d-eb7a-cd3d-60a0-f19cfc076109.htm
---
# Autodesk.Revit.DB.Category.Id Property

Returns the category id associated with the category object.

## Syntax (C#)
```csharp
public ElementId Id { get; }
```